/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

var mainView;
var $$ = Dom7;
mpro = new Framework7({
  material: true,
  precompileTemplates: true,
});
mainView = mpro.addView(".view-main", {});

mpro.onPageInit('empty', function (page) {
    console.log('page info inited');
});

const ALG_MENU = [
  {
    label: "1. Анестезиология и реаниматология",
    items: [
      {
        label: "Клиническая смерть",
        key: "001",
      },
      {
        label: "Ангионевротический отек",
        key: "002",
      },
      {
        label: "Анафилактический шок",
        key: "003",
      },
      {
        label: "Геморрагический шок",
        key: "004",
      },
      {
        label: "Травматический шок",
        key: "005",
      },
      {
        label: "Инфекционно-токсический шок",
        key: "006",
      },
      {
        label: "Ожоговый шок, термоингаляционная травма",
        key: "007",
      },
      {
        label: "Гиповолемический шок",
        key: "008",
      },
      {
        label: "Кома",
        key: "009",
      },
      {
        label: "Общее охлаждение организма (гипотермия)",
        key: "010",
      },
      {
        label: "Воздействие высоких температур",
        key: "011",
      },
      {
        label: "Утопление",
        key: "012",
      },
      {
        label: "Электротравма",
        key: "013",
      },
      {
        label: "Странгуляционная асфиксия (повешение, удушение)",
        key: "014",
      },
      {
        label: "Инородное тело в дыхательных путях",
        key: "015",
      },
      {
        label: "Дыхательная недостаточность",
        key: "016",
      },
      {
        label: "Отёк головного мозга",
        key: "017",
      },
    ],
  },
  {
    label: "2. Терапия",
    items: [
      {
        label: "Злокачественные новообразования",
        key: "018",
      },
      {
        label: "Гемофилия. Болезнь Виллебранда",
        key: "019",
      },
      {
        label: "Гипогликемия",
        key: "020",
      },
      {
        label: "Гипогликемическая кома",
        key: "021",
      },
      {
        label: "Диабетический кетоацидоз",
        key: "022",
      },
      {
        label: "Гипергликемическая кома",
        key: "023",
      },
      {
        label: "Тиреотоксический криз",
        key: "024",
      },
      {
        label: "Надпочечниковый криз (Аддисонов)",
        key: "025",
      },
      {
        label: "Почечная недостаточность. Гломерулонефрит",
        key: "026",
      },
      {
        label: "Хроническая болезнь почек (диабетическая нефропатия, нефротический синдром)",
        key: "027",
      },
      {
        label: "Зависимость от почечного диализа",
        key: "028",
      },
      {
        label: "Наличие трансплантированной почки",
        key: "029",
      },
      {
        label: "Крапивница",
        key: "030",
      },
      {
        label: "Болезни костно-мышечной системы и соединительных тканей",
        key: "031",
      },
      {
        label: "Язвенная болезнь желудка и 12-перстной кишки, без осложнений",
        key: "032",
      },
      {
        label: "Цирроз печени",
        key: "033",
      },
      {
        label: "Пневмония",
        key: "034",
      },
      {
        label: "Хроническая обструктивная болезнь легких",
        key: "035",
      },
      {
        label: "Бронхиальная астма",
        key: "036",
      },
      {
        label: "Анемия",
        key: "037",
      },
    ],
  },
  {
    label: "3. Кардиология",
    items: [
      {
        label: "Острая левожелудочковая недостаточность (сердечная астма, отек легких)",
        key: "038",
      },
      {
        label: "Стабильная ИБС. Стабильная стенокардия",
        key: "039",
      },
      {
        label: "Хроническая сердечная недостаточность",
        key: "040",
      },
      {
        label: "Гипертоническая болезнь (вне криза)",
        key: "041",
      },
      {
        label: "Гипертонический криз",
        key: "042",
      },
      {
        label: "Синусовая тахикардия",
        key: "043",
      },
      {
        label: "Экстрасистолия (в том числе желудочковая, частая и парная)",
        key: "044",
      },
      {
        label: "Пароксизмы эктопической тахикардии с узким комплексом",
        key: "045",
      },
      {
        label: "Пароксизмы эктопической тахикардии с широким комплексом",
        key: "046",
      },
      {
        label: "Фибрилляция-трепетание предсердий",
        key: "047",
      },
      {
        label: "Брадиаритмии и нарушения проводимости",
        key: "048",
      },
      {
        label: "Острый коронарный синдром с подъемом сегмента ST",
        key: "049",
      },
      {
        label: "Острый коронарный синдром без подъема сегмента ST",
        key: "050",
      },
      {
        label: "Кардиогенный шок",
        key: "051",
      },
      {
        label: "Тромбоэмболия легочной артерии",
        key: "052",
      },
      {
        label: "Расслаивающая аневризма аорты",
        key: "053",
      },
    ],
  },
  {
    label: "4. Неврология",
    items: [
      {
        label: "Острая энцефалопатия Гайе-Вернике",
        key: "054",
      },
      {
        label: "Воспалительные болезни центральной нервной системы",
        key: "055",
      },
      {
        label: "Вторичный паркинсонизм. Дистония",
        key: "056",
      },
      {
        label: "Злокачественный нейролептический синдром",
        key: "057",
      },
      {
        label: "Рассеянный склероз",
        key: "058",
      },
      {
        label: "Эпилепсия. Судороги",
        key: "059",
      },
      {
        label: "Эпилептический статус",
        key: "060",
      },
      {
        label: "Мигрень. Головная боль",
        key: "061",
      },
      {
        label: "Мигренозный статус",
        key: "062",
      },
      {
        label: "Нарушение мозгового кровообращения",
        key: "063",
      },
      {
        label: "Болезни периферической нервной системы и межпозвонковых дисков. Дорсалгия",
        key: "064",
      },
      {
        label: "Синдром Гийена-Барре. Воспалительные полиневропатии",
        key: "065",
      },
      {
        label: "Миастенический криз",
        key: "066",
      },
      {
        label: "Болезни спинного мозга",
        key: "067",
      },
      {
        label: "Острая гипертензивная энцефалопатия",
        key: "068",
      },
      {
        label: "Когнитивные расстройства у лиц пожилого и старческого возраста",
        key: "069",
      },
      {
        label: "Обморок (синкопе)",
        key: "070",
      },
    ],
  },
  {
    label: "5. Инфекционные заболевания",
    items: [
      {
        label: "Холера",
        key: "071",
      },
      {
        label: "Чума. Оспа обезьян",
        key: "072",
      },
      {
        label: "Вирусные лихорадки, передаваемые членистоногими, геморрагические лихорадки",
        key: "073",
      },
      {
        label: "Полиомиелит, вызванный диким вирусом",
        key: "074",
      },
      {
        label: "Дифтерия",
        key: "075",
      },
      {
        label: "Малярия",
        key: "076",
      },
      {
        label: "Острый тонзиллит, фарингит, тонзиллофарингит",
        key: "077",
      },
      {
        label: "Острая респираторная вирусная инфекция. Грипп",
        key: "078",
      },
      {
        label: "Новая коронавирусная инфекция (COVID-19)",
        key: "079",
      },
      {
        label: "Вирусная пневмония",
        key: "080",
      },
      {
        label: "Инфекционный мононуклеоз",
        key: "081",
      },
      {
        label: "Лептоспироз",
        key: "082",
      },
      {
        label: "Брюшной тиф, паратифы",
        key: "083",
      },
      {
        label: "Ветряная оспа. Корь. Краснуха. Скарлатина. Эпидемический паротит. Иерсиниоз. Псевдотуберкулез. Коклюш",
        key: "084",
      },
      {
        label: "Системный клещевой боррелиоз. Иксодовый боррелиоз (болезнь Лайма)",
        key: "085",
      },
      {
        label: "Опоясывающий лишай (Herpes zoster)",
        key: "086",
      },
      {
        label: "Ботулизм",
        key: "087",
      },
      {
        label: "Столбняк",
        key: "088",
      },
      {
        label: "Серозный менингит и менингоэнцефалит. Клещевой энцефалит",
        key: "089",
      },
      {
        label: "Бактериальный менингит. Менингит, вызванный другими уточненными возбудителями",
        key: "090",
      },
      {
        label: "Менингококковая инфекция. Менингококковый менингит. Менингококкемия",
        key: "091",
      },
      {
        label: "Бешенство",
        key: "092",
      },
      {
        label: "Острые кишечные инфекции. Бактериальное пищевое отравление",
        key: "093",
      },
      {
        label: "Вирусный гепатит",
        key: "094",
      },
      {
        label: "Рожа",
        key: "095",
      },
    ],
  },
  {
    label: "6. Травматология",
    items: [
      {
        label: "Травмы головы и шеи",
        key: "096",
      },
      {
        label: "Вывих нижней челюсти",
        key: "097",
      },
      {
        label: "Перелом позвоночника. Вывих шейного позвонка",
        key: "098",
      },
      {
        label: "Перелом костей таза. Вывих бедренной кости",
        key: "099",
      },
      {
        label: "Вывихи костей верхних и нижних конечностей",
        key: "100",
      },
      {
        label: "Переломы костей верхних и нижних конечностей, закрытые",
        key: "101",
      },
      {
        label: "Переломы костей верхних и нижних конечностей, открытые",
        key: "102",
      },
      {
        label: "Травма грудной клетки",
        key: "103",
      },
      {
        label: "Травматический пневмоторакс (открытый, закрытый, напряженный)",
        key: "104",
      },
      {
        label: "Гемоторакс",
        key: "105",
      },
      {
        label: "Ушиб, ранение сердца",
        key: "106",
      },
      {
        label: "Открытые раны (огнестрельные, колотые, резаные, укушенные и т.д.)",
        key: "107",
      },
      {
        label: "Размозжения и отчленения конечностей (фрагментов конечностей)",
        key: "108",
      },
      {
        label: "Синдром длительного сдавления",
        key: "109",
      },
      {
        label: "Закрытая травма живота",
        key: "110",
      },
      {
        label: "Открытая травма живота",
        key: "111",
      },
      {
        label: "Травма наружных половых органов",
        key: "112",
      },
      {
        label: "Термические и химические ожоги",
        key: "113",
      },
      {
        label: "Отморожение",
        key: "114",
      },
      {
        label: "Боли под гипсом",
        key: "115",
      },
    ],
  },
  {
    label: "7. Хирургия",
    items: [
      {
        label: "Острый аппендицит",
        key: "116",
      },
      {
        label: "Грыжи брюшной стенки",
        key: "117",
      },
      {
        label: "Перфоративная язва желудка и 12-перстной кишки",
        key: "118",
      },
      {
        label: "Острая кишечная непроходимость",
        key: "119",
      },
      {
        label: "Инородное тело желудочно-кишечного тракта",
        key: "120",
      },
      {
        label: "Острый холецистит",
        key: "121",
      },
      {
        label: "Постхолецистэктомический синдром",
        key: "122",
      },
      {
        label: "Острый панкреатит",
        key: "123",
      },
      {
        label: "Желудочно-кишечное кровотечение",
        key: "124",
      },
      {
        label: "Кровотечение из варикозно-расширенных вен пищевода",
        key: "125",
      },
      {
        label: "Легочное кровотечение",
        key: "126",
      },
      {
        label: "Острое нарушение мезентериального кровообращения",
        key: "127",
      },
      {
        label: "Перитонит распространенный",
        key: "128",
      },
      {
        label: "Спонтанный пневмоторакс",
        key: "129",
      },
      {
        label: "Спонтанный разрыв пищевода",
        key: "130",
      },
      {
        label: "Геморрой",
        key: "131",
      },
      {
        label: "Острая тромбоз артерий верхних и нижних конечностей",
        key: "132",
      },
      {
        label: "Острый тромбофлебит верхних и нижних конечностей",
        key: "133",
      },
      {
        label: "Варикозно-расширенные вены нижних конечностей",
        key: "134",
      },
      {
        label: "Трофические язвы",
        key: "135",
      },
      {
        label: "Инфекции кожи и подкожной клетчатки",
        key: "136",
      },
      {
        label: "Карбункул, абсцесс, флегмона, костный панариций",
        key: "137",
      },
      {
        label: "Остеомиелит",
        key: "138",
      },
      {
        label: "Гангрена",
        key: "139",
      },
      {
        label: "Осложнения травм и медицинских манипуляций",
        key: "140",
      },
    ],
  },
  {
    label: "8. Урология",
    items: [
      {
        label: "Пиелонефрит (острый)",
        key: "141",
      },
      {
        label: "Камни почек и мочеточников. Почечная колика",
        key: "142",
      },
      {
        label: "Острый цистит у женщин",
        key: "143",
      },
      {
        label: "Острая задержка мочеиспускания у женщин",
        key: "144",
      },
      {
        label: "Острая задержка мочеиспускания у мужчин",
        key: "145",
      },
      {
        label: "Макрогематурия визуальная, безболевая",
        key: "146",
      },
      {
        label: "Острый простатит, цистит у мужчин",
        key: "147",
      },
      {
        label: "Перекручивание яичка",
        key: "148",
      },
      {
        label: "Острый эпидидимоорхит",
        key: "149",
      },
      {
        label: "Баланопостит",
        key: "150",
      },
      {
        label: "Парафимоз. Приапизм",
        key: "151",
      },
      {
        label: "Осложнения, связанное с уретральным катетером, дренажом, цистостомой",
        key: "152",
      },
    ],
  },
  {
    label: "9. Акушерство и гинекология",
    items: [
      {
        label: "Прерывание беременности в сроке до 22 недель",
        key: "153",
      },
      {
        label: "Эндометрит после аборта",
        key: "154",
      },
      {
        label: "Кровотечение после аборта",
        key: "155",
      },
      {
        label: "Внематочная беременность",
        key: "156",
      },
      {
        label: "Апоплексия яичника. Разрыв кисты яичника. Перекрут кисты яичника",
        key: "157",
      },
      {
        label: "Альгодисменорея",
        key: "158",
      },
      {
        label: "Аномальное маточное кровотечение",
        key: "159",
      },
      {
        label: "Острый сальпингит, оофорит, эндометрит, тазовый перитонит, параметрит",
        key: "160",
      },
      {
        label: "Киста бартолиновой железы",
        key: "161",
      },
      {
        label: "Абсцесс бартолиновой железы",
        key: "162",
      },
      {
        label: "Выпадение женских половых органов",
        key: "163",
      },
      {
        label: "Гиперстимуляция яичников",
        key: "164",
      },
      {
        label: "Предлежание плаценты",
        key: "165",
      },
      {
        label: "Преждевременная отслойка нормально расположенной плаценты",
        key: "166",
      },
      {
        label: "Чрезмерная рвота беременных",
        key: "167",
      },
      {
        label: "Отеки, вызванные беременностью",
        key: "168",
      },
      {
        label: "Гипертензия. Преэклампсия",
        key: "169",
      },
      {
        label: "Эклампсия",
        key: "170",
      },
      {
        label: "Разрыв матки",
        key: "171",
      },
      {
        label: "Преждевременные роды",
        key: "172",
      },
      {
        label: "Роды вне родильного дома",
        key: "173",
      },
      {
        label: "Послеродовый сепсис",
        key: "174",
      },
      {
        label: "Осложнения послеродового периода",
        key: "175",
      },
      {
        label: "Послеродовое кровотечение",
        key: "176",
      },
      {
        label: "Лактостаз",
        key: "177",
      },
      {
        label: "Мастит лактационный",
        key: "178",
      },
    ],
  },
  {
    label: "10. Офтальмология",
    items: [
      {
        label: "Острый приступ глаукомы",
        key: "179",
      },
      {
        label: "Травм века, окологлазничной области, конъюнктивы, роговицы",
        key: "180",
      },
      {
        label: "Травма глазного яблока и глазницы",
        key: "181",
      },
      {
        label: "Инородное тело в наружной части глаза (роговицы, склеры)",
        key: "182",
      },
      {
        label: "Ожоги глаз (термические и химические)",
        key: "183",
      },
      {
        label: "Воспалительные заболевания глаза и его придатков",
        key: "184",
      },
      {
        label: "Электроофтальмия",
        key: "185",
      },
      {
        label: "Окклюзия сосудов сетчатки",
        key: "186",
      },
      {
        label: "Отслойка сетчатки. Гемофтальм",
        key: "187",
      },
    ],
  },
  {
    label: "11. Оториноларингология",
    items: [
      {
        label: "Носовое кровотечение",
        key: "188",
      },
      {
        label: "Кровотечение из глотки, гортани, трахеостомы",
        key: "189",
      },
      {
        label: "Кровотечение из наружного слухового прохода (посттравматическое)",
        key: "190",
      },
      {
        label: "Перелом костей носа",
        key: "191",
      },
      {
        label: "Травматический разрыв барабанной перепонки",
        key: "192",
      },
      {
        label: "Инородное тело наружного слухового прохода",
        key: "193",
      },
      {
        label: "Инородное тело в носовом ходе",
        key: "194",
      },
      {
        label: "Инородное тело дыхательных путях",
        key: "195",
      },
      {
        label: "Паратонзиллярный абсцесс, ретро- и парафарингеальный абсцесс, абсцесс глотки (язычной миндалины)",
        key: "196",
      },
      {
        label: "Острый средний отит. Мастоидит",
        key: "197",
      },
      {
        label: "Наружный отит. Другие болезни наружного уха",
        key: "198",
      },
      {
        label: "Абсцесс, фурункул, карбункул ушной раковины или слухового прохода",
        key: "199",
      },
      {
        label: "Острый синусит",
        key: "200",
      },
      {
        label: "Болезни внутреннего уха",
        key: "201",
      },
    ],
  },
  {
    label: "12. Стоматология",
    items: [
      {
        label: "Кровотечение (стоматология)",
        key: "202",
      },
      {
        label: "Стоматит, гингивит, глоссит",
        key: "203",
      },
      {
        label: "Пульпит, острый пародонтит, синдром прорезывания зубов",
        key: "204",
      },
      {
        label: "Периостит, перекоронит, остеомиелит челюсти. Острый лимфаденит лица, головы и шеи (одонтогенный)",
        key: "205",
      },
      {
        label: "Абсцесс, флегмона лица",
        key: "206",
      },
    ],
  },
  {
    label: "13. Токсикология",
    items: [
      {
        label: "Отравление противоинфекционными средствами, гормонами, их заменителями и антагонистами",
        key: "207",
      },
      {
        label: "Отравление противодиабетическими препаратами",
        key: "208",
      },
      {
        label: "Отравление анальгезирующими, жаропонижающими и противоревматическими средствами",
        key: "209",
      },
      {
        label: "Отравление опиатами, опиоидами, лоперамидом",
        key: "210",
      },
      {
        label: "Отравление синтетическими наркотиками, кокаином, амфетаминами (экстази), галлюциногенами",
        key: "211",
      },
      {
        label: "Отравление противосудорожными, седативными, снотворными, психотропными средствами",
        key: "212",
      },
      {
        label: "Отравление ингибиторами холинэстеразы (прозерин, нивалин)",
        key: "213",
      },
      {
        label: "Отравление антихолинергическими, антимускаринными, спазмолитическими средствами, бета-адреноблокаторами",
        key: "214",
      },
      {
        label: "Отравление препаратами, действующими на сердечно-сосудистую систему",
        key: "215",
      },
      {
        label: "Токсическое действие алкоголя (этилового спирта)",
        key: "216",
      },
      {
        label: "Токсическое действие метанола, органических растворителей",
        key: "217",
      },
      {
        label: "Токсическое действие галогенопроизводных алифатических и ароматических углеводородов",
        key: "218",
      },
      {
        label: "Токсическое действие разъедающих веществ, мыл и детергентов",
        key: "219",
      },
      {
        label: "Токсическое действие соединений тяжелых металлов, неорганических веществ",
        key: "220",
      },
      {
        label: "Токсическое действие окиси углерода, других газов, дымов и паров",
        key: "221",
      },
      {
        label: "Токсическое действие пестицидов, инсектицидов (фосфорорганические и карбаматные соединения)",
        key: "222",
      },
      {
        label: "Токсическое действие ядовитых веществ, содержащихся в грибах, ягодах и других растениях",
        key: "223",
      },
      {
        label: "Токсический эффект, обусловленный контактом с ядовитыми животными",
        key: "224",
      },
      {
        label: "Токсическое действие и неуточненных веществ. Отравление цианидами, метгемоглобинобразователями",
        key: "225",
      },
    ],
  },
  {
    label: "14. Детская анестезиология и реаниматология",
    items: [
      {
        label: "Клиническая смерть (дети)",
        key: "226",
      },
      {
        label: "Геморрагический шок (острая массивная кровопотеря), травматический шок (дети)",
        key: "227",
      },
      {
        label: "Септический шок. Септицемия. Синдром токсического шока (дети)",
        key: "228",
      },
      {
        label: "Аллергический отек верхних дыхательных путей (дети)",
        key: "229",
      },
      {
        label: "Анафилактический шок (дети)",
        key: "230",
      },
      {
        label: "Ожоговый шок, термоингаляционная травма (дети)",
        key: "231",
      },
      {
        label: "Дегидратация, уменьшение объема жидкости, гиповолемический шок (дети)",
        key: "232",
      },
      {
        label: "Кома (в т.ч. неустановленного генеза) (дети)",
        key: "233",
      },
      {
        label: "Общее охлаждение организма (гипотермия) (дети)",
        key: "234",
      },
      {
        label: "Воздействие высоких температур (дети)",
        key: "235",
      },
      {
        label: "Утопление (дети)",
        key: "236",
      },
      {
        label: "Электротравма (дети)",
        key: "237",
      },
      {
        label: "Странгуляционная асфиксия (повешение, удушение) (дети)",
        key: "238",
      },
      {
        label: "Инородное тело в дыхательных путях (дети)",
        key: "239",
      },
      {
        label: "Отек головного мозга (дети)",
        key: "240",
      },
    ],
  },
  {
    label: "15. Общая педиатрия",
    items: [
      {
        label: "Злокачественные новообразования (дети)",
        key: "241",
      },
      {
        label: "Гемофилия. Болезнь Виллебранда (дети)",
        key: "242",
      },
      {
        label: "Гипогликемия (дети)",
        key: "243",
      },
      {
        label: "Гипогликемическая кома (дети)",
        key: "244",
      },
      {
        label: "Диабетический кетоацидоз (дети)",
        key: "245",
      },
      {
        label: "Гипергликемические комы (дети)",
        key: "246",
      },
      {
        label: "Крапивница (дети)",
        key: "247",
      },
      {
        label: "Ангионевротический отек (дети)",
        key: "248",
      },
      {
        label: "Болезни костно-мышечной системы и соединительных тканей (дети)",
        key: "249",
      },
      {
        label: "Язвенная болезнь желудка и 12-перстной кишки, без осложнений (дети)",
        key: "250",
      },
      {
        label: "Острый обструктивный ларингит (круп) (дети)",
        key: "251",
      },
      {
        label: "Острый бронхит (дети)",
        key: "252",
      },
      {
        label: "Бронхиолит (у детей до 2 лет)",
        key: "253",
      },
      {
        label: "Эпиглоттит (дети)",
        key: "254",
      },
      {
        label: "Пневмония (дети)",
        key: "255",
      },
      {
        label: "Бронхиальная астма (дети)",
        key: "256",
      },
      {
        label: "Жизнеугрожающая астма (Астматический статус) или ДН IV ст. (дети)",
        key: "257",
      },
    ],
  },
  {
    label: "16. Неонатология",
    items: [
      {
        label: "Омфалит (дети)",
        key: "258",
      },
      {
        label: "Мастит новорожденного",
        key: "259",
      },
      {
        label: "Пиодермия (дети)",
        key: "260",
      },
      {
        label: "Гемолитическая болезнь новорожденного",
        key: "261",
      },
      {
        label: "Геморрагическая болезнь новорожденного",
        key: "262",
      },
      {
        label: "Метеоризм (дети)",
        key: "263",
      },
      {
        label: "Запор (дети)",
        key: "264",
      },
      {
        label: "Неонатальный аспирационный синдром. Неонатальная аспирационная пневмония",
        key: "265",
      },
      {
        label: "Неблагоприятные реакции на бактериальные, другие и неуточненные вакцины и биологические вещества (дети)",
        key: "266",
      },
      {
        label: "Пилороспазм. Пилоростеноз (дети)",
        key: "267",
      },
      {
        label: "Неонатальная желтуха",
        key: "268",
      },
    ],
  },
  {
    label: "17. Детская кардиология",
    items: [
      {
        label: "Гипертонический криз (дети)",
        key: "269",
      },
      {
        label: "Тахисистолические нарушения сердечного ритма (дети)",
        key: "270",
      },
      {
        label: "Брадисистолические нарушения сердечного ритма (дети)",
        key: "271",
      },
      {
        label: "АВ блокады I–II ст. Состояние средней степени тяжести без нарушений сознания (дети)",
        key: "272",
      },
      {
        label: "Тромбоэмболия легочной артерии (дети)",
        key: "273",
      },
    ],
  },
  {
    label: "18. Детская неврология",
    items: [
      {
        label: "Рассеянный склероз (дети)",
        key: "274",
      },
      {
        label: "Злокачественный нейролептический синдром (дети)",
        key: "275",
      },
      {
        label: "Эпилепсия. Судороги (дети)",
        key: "276",
      },
      {
        label: "Эпилептический статус (дети)",
        key: "277",
      },
      {
        label: "Мигрень. Головная боль (дети)",
        key: "278",
      },
      {
        label: "Мигренозный статус (дети)",
        key: "279",
      },
      {
        label: "Болезни периферической нервной системы и межпозвонковых дисков. Дорсалгия (дети)",
        key: "280",
      },
      {
        label: "Синдром Гийена–Барре. Воспалительные полиневропатии (дети)",
        key: "281",
      },
      {
        label: "Миастенический криз (дети)",
        key: "282",
      },
      {
        label: "Болезни спинного мозга (дети)",
        key: "283",
      },
      {
        label: "Расстройства вегетативной нервной системы (дети)",
        key: "284",
      },
    ],
  },
  {
    label: "19. Инфекционные заболевания у детей",
    items: [
      {
        label: "Холера (дети)",
        key: "285",
      },
      {
        label: "Чума. Mpox (оспа обезьян) (дети)",
        key: "286",
      },
      {
        label: "Вирусные лихорадки, передаваемые членистоногими, а также вирусные геморрагические лихорадки (дети)",
        key: "287",
      },
      {
        label: "Полиомиелит, вызванный диким вирусом (дети)",
        key: "288",
      },
      {
        label: "Дифтерия (дети)",
        key: "289",
      },
      {
        label: "Малярия (дети)",
        key: "290",
      },
      {
        label: "Острый тонзиллит, фарингит, тонзиллофарингит (дети)",
        key: "291",
      },
      {
        label: "Острая респираторная вирусная инфекция. Грипп (дети)",
        key: "292",
      },
      {
        label: "Новая коронавирусная инфекция (COVID-19) (дети)",
        key: "293",
      },
      {
        label: "Инфекционный мононуклеоз (дети)",
        key: "294",
      },
      {
        label: "Лептоспироз (дети)",
        key: "295",
      },
      {
        label: "Брюшной тиф, паратифы (дети)",
        key: "296",
      },
      {
        label: "Ветряная оспа. Корь. Краснуха. Скарлатина. Эпидемический паротит. Иерсиниоз. Псевдотуберкулез. Коклюш (дети)",
        key: "297",
      },
      {
        label: "Клещевой боррелиоз (болезнь Лайма, иксодовый клещевой боррелиоз, системный клещевой боррелиоз, лайм-боррелиоз) (дети)",
        key: "298",
      },
      {
        label: "Опоясывающий герпес (Herpes zoster) (дети)",
        key: "299",
      },
      {
        label: "Ботулизм (дети)",
        key: "300",
      },
      {
        label: "Столбняк (дети)",
        key: "301",
      },
      {
        label: "Вирусный менингит и менингоэнцефалит. Клещевой вирусный энцефалит (дети)",
        key: "302",
      },
      {
        label: "Бактериальный менингит неуточненный. Менингит, вызванный другими уточненными возбудителями (дети)",
        key: "303",
      },
      {
        label: "Менингококковый менингит. Менингококкемия (дети)",
        key: "304",
      },
      {
        label: "Бешенство (дети)",
        key: "305",
      },
      {
        label: "Острые кишечные инфекции. Бактериальное пищевое отравление (дети)",
        key: "306",
      },
      {
        label: "Вирусный гепатит (дети)",
        key: "307",
      },
      {
        label: "Рожа (дети)",
        key: "308",
      },
    ],
  },
  {
    label: "20. Детская травматология",
    items: [
      {
        label: "Черепно-мозговая травма (дети)",
        key: "309",
      },
      {
        label: "Вывих нижней челюсти (дети)",
        key: "310",
      },
      {
        label: "Перелом позвоночника. Вывих шейного позвонка (дети)",
        key: "311",
      },
      {
        label: "Перелом костей таза. Вывих бедренной кости (дети)",
        key: "312",
      },
      {
        label: "Вывихи костей конечностей (дети)",
        key: "313",
      },
      {
        label: "Переломы костей конечностей закрытые (дети)",
        key: "314",
      },
      {
        label: "Переломы костей открытые (дети)",
        key: "315",
      },
      {
        label: "Травма грудной клетки (дети)",
        key: "316",
      },
      {
        label: "Изолированные переломы менее 3-х ребер (дети)",
        key: "317",
      },
      {
        label: "Множественные переломы ребер (3 ребра и более), перелом первого и второго ребер (дети)",
        key: "318",
      },
      {
        label: "Перелом грудины (дети)",
        key: "319",
      },
      {
        label: "Травматический пневмоторакс (открытый, закрытый, напряженный) (дети)",
        key: "320",
      },
      {
        label: "Гемоторакс (дети)",
        key: "321",
      },
      {
        label: "Ушиб, ранение сердца (дети)",
        key: "322",
      },
      {
        label: "Открытые раны (огнестрельные, колотые, резаные, укушенные и т.д.) (дети)",
        key: "323",
      },
      {
        label: "Размозжение и отчленение конечностей (дети)",
        key: "324",
      },
      {
        label: "Синдром длительного сдавления (дети)",
        key: "325",
      },
      {
        label: "Закрытая травма живота (дети)",
        key: "326",
      },
      {
        label: "Открытая травма живота (дети)",
        key: "327",
      },
      {
        label: "Травма наружных половых органов (дети)",
        key: "328",
      },
      {
        label: "Термические и химические ожоги (дети)",
        key: "329",
      },
      {
        label: "Отморожение (дети)",
        key: "330",
      },
      {
        label: "Боли под гипсом (дети)",
        key: "331",
      },
    ],
  },
  {
    label: "21. Детская хирургия",
    items: [
      {
        label: "Острый аппендицит (дети)",
        key: "332",
      },
      {
        label: "Грыжи брюшной стенки (дети)",
        key: "333",
      },
      {
        label: "Перфоративная язва желудка и 12-перстной кишки (дети)",
        key: "334",
      },
      {
        label: "Острая кишечная непроходимость. Инвагинация кишечника (дети)",
        key: "335",
      },
      {
        label: "Запор (дети)",
        key: "336",
      },
      {
        label: "Инородное тело желудочно-кишечного тракта (дети)",
        key: "337",
      },
      {
        label: "Острый холецистит (дети)",
        key: "338",
      },
      {
        label: "Острый панкреатит (дети)",
        key: "339",
      },
      {
        label: "Желудочно-кишечное кровотечение (дети)",
        key: "340",
      },
      {
        label: "Перитонит распространенный (дети)",
        key: "341",
      },
      {
        label: "Спонтанный пневмоторакс (дети)",
        key: "342",
      },
      {
        label: "Геморрой (дети)",
        key: "343",
      },
      {
        label: "Инфекции кожи и подкожной клетчатки (дети)",
        key: "344",
      },
      {
        label: "Карбункул, абсцесс, флегмона, костный панариций, острый лимфаденит (дети)",
        key: "345",
      },
      {
        label: "Остеомиелит (дети)",
        key: "346",
      },
      {
        label: "Осложнения травм и медицинских манипуляций (дети)",
        key: "347",
      },
    ],
  },
  {
    label: "22. Детская урология",
    items: [
      {
        label: "Пиелонефрит. Цистит (дети)",
        key: "348",
      },
      {
        label: "Камни почек и мочеточников. Почечная колика (дети)",
        key: "349",
      },
      {
        label: "Острая задержка мочеиспускания (дети)",
        key: "350",
      },
      {
        label: "Макрогематурия визуальная, безболевая (дети)",
        key: "351",
      },
      {
        label: "Перекручивание (гидатиды) яичка. Острый эпидидимоорхит (дети)",
        key: "352",
      },
      {
        label: "Баланопостит (дети)",
        key: "353",
      },
      {
        label: "Парафимоз. Приапизм (дети)",
        key: "354",
      },
    ],
  },
  {
    label: "23. Детская гинекология",
    items: [
      {
        label: "Апоплексия яичника. Разрыв кисты яичника. Перекрут кисты яичника (дети)",
        key: "355",
      },
      {
        label: "Аномальное маточное кровотечение (дети)",
        key: "356",
      },
      {
        label: "Альгодисменорея (дети)",
        key: "357",
      },
      {
        label: "Острый сальпингит, оофорит, эндометрит (дети)",
        key: "358",
      },
      {
        label: "Острый тазовый перитонит, острый параметрит (дети)",
        key: "359",
      },
      {
        label: "Киста бартолиновой железы (дети)",
        key: "360",
      },
      {
        label: "Абсцесс бартолиновой железы (дети)",
        key: "361",
      },
    ],
  },
  {
    label: "24. Детская офтальмология",
    items: [
      {
        label: "Открытая рана века и окологлазничной области. Травма конъюнктивы и ссадина роговицы (дети)",
        key: "362",
      },
      {
        label: "Травма глаза (дети)",
        key: "363",
      },
      {
        label: "Инородное тело в наружной части глаза (роговицы, склеры) (дети)",
        key: "364",
      },
      {
        label: "Ожоги глаз (термические и химические) (дети)",
        key: "365",
      },
      {
        label: "Воспалительные заболевания глаза и его придатков (дети)",
        key: "366",
      },
      {
        label: "Электроофтальмия (дети)",
        key: "367",
      },
      {
        label: "Отслойка сетчатки. Гемофтальм (дети)",
        key: "368",
      },
    ],
  },
  {
    label: "25. Детская оториноларингология",
    items: [
      {
        label: "Носовое кровотечение (дети)",
        key: "369",
      },
      {
        label: "Кровотечение из других отделов верхних дыхательных путей (глотки, гортани). Кровотечение из трахеостомы (дети)",
        key: "370",
      },
      {
        label: "Кровотечение из наружного слухового прохода (посттравматическое) (дети)",
        key: "371",
      },
      {
        label: "Перелом костей носа (дети)",
        key: "372",
      },
      {
        label: "Травматический разрыв барабанной перепонки (дети)",
        key: "373",
      },
      {
        label: "Инородное тело наружного слухового прохода (дети)",
        key: "374",
      },
      {
        label: "Инородное тело в носовом ходе (дети)",
        key: "375",
      },
      {
        label: "Инородное тело в дыхательных путях (дети)",
        key: "376",
      },
      {
        label: "Паратонзиллярный абсцесс, ретро- и парафарингеальный абсцесс, абсцесс глотки (язычной миндалины) (дети)",
        key: "377",
      },
      {
        label: "Острый средний отит. Мастоидит (дети)",
        key: "378",
      },
      {
        label: "Наружный отит. Другие болезни наружного уха (дети)",
        key: "379",
      },
      {
        label: "Абсцесс, фурункул, карбункул ушной раковины или слухового прохода (дети)",
        key: "380",
      },
      {
        label: "Острый синусит (дети)",
        key: "381",
      },
      {
        label: "Болезни внутреннего уха (дети)",
        key: "382",
      },
    ],
  },
  {
    label: "26. Детская стоматология",
    items: [
      {
        label: "Кровотечение (стоматология) (дети)",
        key: "383",
      },
      {
        label: "Стоматит, гингивит, глоссит (дети)",
        key: "384",
      },
      {
        label: "Пульпит, острый пародонтит, синдром прорезывания зубов (дети)",
        key: "385",
      },
      {
        label: "Периостит, остеомиелит челюсти. Острый лимфаденит лица, головы и шеи (одонтогенный) (дети)",
        key: "386",
      },
      {
        label: "Абсцесс, флегмона лица (дети)",
        key: "387",
      },
    ],
  },
];
var KLIN_REC;
$$.getJSON("data/klin/all_klin.json", function (data) {
    KLIN_REC = data;
});
// МКБ
var mkbLEVEL1 = {};
var mkbLEVEL2 = {};
var mkbLEVEL3 = {};
var mkbLEVEL4 = {};
$$.getJSON("data/mkb/level1.json",function(data){
	mkbLEVEL1 = data;
});
$$.getJSON("data/mkb/level2.json",function(data){
	mkbLEVEL2 = data;
});
$$.getJSON("data/mkb/level3.json",function(data){
	mkbLEVEL3 = data;
});
$$.getJSON("data/mkb/level4.json",function(data){
	mkbLEVEL4 = data;
});
// --МКБ

//МКБ-10
mpro.onPageInit("mkb", function (page) {
  if (page.query.code) {
    page.container.querySelector('[data-caption="true"]').innerHTML += " ( " + page.query.code + " )";
    var level = page.query.level;
    if (level == 2) {
      page.container.querySelector('[data-section="list"]').innerHTML = Template7.templates.mkb102Tmpl(mkbLEVEL2[page.query.code]);
    } else if (level == 3) {
      page.container.querySelector('[data-section="list"]').innerHTML = Template7.templates.mkb103Tmpl(mkbLEVEL3[page.query.code]);
    } else {
      page.container.querySelector('[data-section="list"]').innerHTML = Template7.templates.mkb104Tmpl(mkbLEVEL4[page.query.code]);
    }
  } else {
    page.container.querySelector('[data-section="list"]').innerHTML = Template7.templates.mkb101Tmpl(mkbLEVEL1);
  }
});
// --МКБ-10
// Страница - Клин.Рекомендаций
mpro.onPageInit("klin_single", function (page) {
//   if (FSIZE) page.container.classList.add(FSIZE);
  mainView.reloadPage("klin_un01.html");
  if (page.query.id == 666) {
    mainView.router.load({ url: "aig.html", reload: true, force: true });
    return;
  }
  var url_page = "Klinrec_" + page.query.id + ".html";
  $$.get("data/klin/" + url_page, function (data) {
    var htmlParse = document.createElement("div");
    htmlParse.innerHTML = data;
    var c = htmlParse.querySelector('[data-caption="true"]');
    if (c) page.container.querySelector("[data-navcap]").innerText = c.innerText;
    page.container.querySelector("#tab1").appendChild(htmlParse.querySelector('[data-section="opisanie"]'));
    page.container.querySelector("#tab2").appendChild(htmlParse.querySelector('[data-section="ls1"]'));
    page.container.querySelector("#tab3").appendChild(htmlParse.querySelector('[data-section="ls2"]'));
    // Аббривиатуры
    $$("abbr").on("click", function () {
      var clickedLink = this;
      var popoverHTML = '<div class="popover">' + '<div class="popover-inner">' + '<div class="content-block">' + "" + this.title + "" + "</div>" + "</div>" + "</div>";
    //   POPUPISOPEM.POPOVER = true;
      mpro.popover(popoverHTML, clickedLink);
    });
    // --Аббривиатуры
    $$(page.container.querySelector("#tab1")).on("show", function () {
      page.container.querySelector(".page-content").scrollTop = 0;
    });

    $$(page.container.querySelector("#tab2")).on("show", function () {
      page.container.querySelector(".page-content").scrollTop = 0;
    });

    $$(page.container.querySelector("#tab3")).on("show", function () {
      page.container.querySelector(".page-content").scrollTop = 0;
    });
  });
});
//Конец - Клин.Рекомендация
//АЛГОРИТМЫ СМП
mpro.onPageInit("algorithm_menu", function (page) {
    const list = page.container.querySelector('[data-section="list"]');
    const title = page.container.querySelector("[data-caption]");
    if(page.query.indx){
        const i = parseInt(page.query.indx);
        title.innerText = ALG_MENU[i].label;
        list.innerHTML = Template7.templates.algorithm_sub_menu(ALG_MENU[i].items);
    } else {
        title.innerText = "Алгоритмы СМП";
        list.innerHTML = Template7.templates.algorithm_main_menu(ALG_MENU);
    }
});
// --АЛГОРИТМЫ СМП
/* =========================================
АТЛАС ЭКГ
============================================*/
mpro.onPageInit("atlas_ekg", function (page) {
//   if (FSIZE) page.container.classList.add(FSIZE);
  var url_page = "Atlas_EKG_" + page.query.id + ".html";
  $$.get("data/ekg/" + url_page, function (data) {
    page.container.querySelector(".page-content").innerHTML = data;
    var c = page.container.querySelector('[data-caption="true"]');
    if (c) page.container.querySelector("[data-navcap]").innerText = c.innerText;
  });
});
/* =========================================
АТЛАС МАНИПУЛЯЦИЙ
============================================*/
mpro.onPageInit("atlas_manipulation", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var url_page = "Atlas manipul_" + page.query.id + ".html";
  $$.get("data/manipulation/" + url_page, function (data) {
    page.container.querySelector(".page-content").innerHTML = data;
    var c = page.container.querySelector('[data-caption="true"]');
    if (c) page.container.querySelector("[data-navcap]").innerText = c.innerText;
  });
});
//==========================================
/* =========================================
АТЛАС МАНИПУЛЯЦИЙ
============================================*/
mpro.onPageInit("atlas_derma", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var url_page = "Derma_" + page.query.id + ".html";
  $$.get("data/derma/" + url_page, function (data) {
    page.container.querySelector(".page-content").innerHTML = data;
    var c = page.container.querySelector('[data-caption="true"]');
    if (c) page.container.querySelector("[data-navcap]").innerText = c.innerText;
  });
});
//==========================================
/* =========================================
АТЛАС ЭКГ
============================================*/
mpro.onPageInit("algorithm", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var url_page = "Algoritm_" + page.query.key + ".html";
  $$.get("data/algorithm/" + url_page, function (data) {
    page.container.querySelector(".page-content").innerHTML = data;
    var c = page.container.querySelector(".title-page");
    if (c) page.container.querySelector("[data-navcap]").innerText = c.innerText;
    else {
      for (let i = 0; i < ALG_MENU.length; i++) {
        let item = ALG_MENU[i].items.find((item) => {
          item.key == page.query.key;
        });
        if (item) {
          page.container.querySelector("[data-navcap]").innerText = item.label;
          return;
        }
      }
    }
  });
});
/* =========================================
Приложения
============================================*/
mpro.onPageInit("pril_details", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var url_page = "Pril_" + page.query.id + ".html";
  $$.get("data/pril/" + url_page, function (data) {
    page.container.querySelector(".page-content").innerHTML = data;
    var c = page.container.querySelector('[data-caption="true"]');
    if (c) page.container.querySelector("[data-navcap]").innerText = c.innerText;
  });
});
/* =========================================
Приложения
============================================*/
mpro.onPageInit("calc_ls", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var url_page = "Pril_" + page.query.id + ".html";
  var id_calc = page.query.id;
  var calc = page.container.querySelector('[data-calc="' + id_calc + '"]');
  if (!calc) return;
  calc.classList.remove("hidden");
  page.container.querySelector("[data-navcap]").innerHTML = calc.dataset["caption"];

  var outRes = function (txt) {
    calc.querySelector('[data-block="result"]').innerHTML = txt;
  };
  var fcalc = null;
  function rangeFromTo() {
    var kgDiv = calc.querySelector('[data-section="kg"]');
    var unit = "";
    $$(calc)
      .find('[type="range"]')
      .on("input", function () {
        var fix = 1;
        if (this.dataset["unit"]) unit = this.dataset["unit"];
        if (this.dataset["fix"]) fix = +this.dataset["fix"];
        kgDiv.innerHTML = this.value + " кг";
        var from = +this.dataset["from"];
        var to = +this.dataset["to"];
        var r = (this.value * from).toFixed(fix) + " - " + (this.value * to).toFixed(fix) + " " + unit;
        outRes(r.replace(".", ",").replace(".", ","));
      });
    $$(calc).find('[type="range"]').trigger("input");
  }
  function rangeKoeff() {
    var kgDiv = calc.querySelector('[data-section="kg"]');
    var unit = "";
    $$(calc)
      .find('[type="range"]')
      .on("input", function () {
        var fix = 1;
        if (this.dataset["unit"]) unit = this.dataset["unit"];
        if (this.dataset["fix"]) fix = +this.dataset["fix"];
        kgDiv.innerHTML = this.value + " кг";
        var koeff = +this.dataset["koeff"];
        var r = (this.value * koeff).toFixed(fix).replace(".", ",") + " " + unit;
        outRes(r);
      });
    $$(calc).find('[type="range"]').trigger("input");
  }
  function radioAndRange() {
    var koeff = 1;
    $$(calc)
      .find('[type="radio"]')
      .on("change", function () {
        koeff = this.value;
        $$(calc).find('[type="range"]').trigger("input");
      });
    var kgDiv = calc.querySelector('[data-section="kg"]');
    $$(calc)
      .find('[type="range"]')
      .on("input", function () {
        kgDiv.innerHTML = this.value + " кг";
        var unit, fix;
        if (this.dataset["unit"]) unit = this.dataset["unit"];
        if (this.dataset["fix"]) fix = +this.dataset["fix"];
        var r = (this.value * koeff).toFixed(fix) + " " + unit;
        outRes(r);
      });
    $$(calc).find('[type="radio"]').trigger("change");
  }
  switch (parseInt(id_calc)) {
    case 1:
    case 3:
    case 4:
    case 17: //Магния сульфат
    case 18: //Фенилэфрин (Мезатон)
    case 23: //Калия и магния аспарагинат
    case 24: //Прометазин (Пипольфен)
    case 25: //Тримеперидин (Промедол)
    case 27: //Хлоропирамин (Супрастин)
    case 29: //Аминофиллин (Эуфиллин)
      fcalc = function () {
        calc.querySelector("select").onchange = function () {
          outRes(this.options[this.options.selectedIndex].value);
        };
      };
      break;
    case 2:
    case 6:
    case 8: //Бендазол (Дибазол)
    case 11: //Дифенгидрамин (Димедрол)
    case 12: //Кальция-глюконат
    case 13: //Кальция хлорид
    case 14: //Кофеин (Кофеин-бензоат натрия)
    case 15: //Никетамид (Кордиамин)
    case 16: //Кокарбоксилаза
    case 19: //Прокаинамид (Новокаинамид)
    case 20: //Дротаверин (Но-шпа)
    case 37: //Фенотерол + ипратропия бромид (Беродуал)
    case 39: //Парацетамол
    case 40: //Ибупрофен (Нурофен)
      fcalc = function () {
        $$(calc)
          .find('[type="radio"]')
          .on("change", function () {
            outRes(this.value);
          });
      };
      break;
    case 7: //Натрия оксибутират
      fcalc = function () {
        var koeff = [100, 150];
        $$(calc)
          .find('[type="radio"]')
          .on("change", function () {
            koeff = this.value.split("-");
            koeff[0] = parseInt(koeff[0]);
            koeff[1] = parseInt(koeff[1]);
            if (this.value === "100-150") {
              $$(calc).find('[data-range="boy"]').addClass("hidden");
              $$(calc).find('[data-range="old"]').removeClass("hidden");
              $$(calc).find('[data-range="old"]').trigger("input");
            } else {
              $$(calc).find('[data-range="boy"]').removeClass("hidden");
              $$(calc).find('[data-range="old"]').addClass("hidden");
              $$(calc).find('[data-range="boy"]').trigger("input");
            }
          });
        var kgDiv = calc.querySelector('[data-section="kg"]');
        $$(calc)
          .find('[type="range"]')
          .on("input", function () {
            kgDiv.innerHTML = this.value + " кг";
            var r = this.value * koeff[0] + " - " + this.value * koeff[1] + " мг";
            outRes(r);
          });
        $$(calc).find('[data-range="old"]').trigger("input");
      };
      break;
    case 9: //Дексаметазон
      fcalc = function () {
        var kgDiv = calc.querySelector('[data-section="kg"]');
        $$(calc)
          .find('[type="range"]')
          .on("input", function () {
            kgDiv.innerHTML = this.value + " кг";
            var r = (this.value * 0.3).toFixed(1) + " - " + (this.value * 0.5).toFixed(1) + " мг";
            outRes(r.replace(".", ",").replace(".", ","));
          });
      };
      break;
    case 5: //Гидрокортизон
    case 21: //Преднизолон,мг
    case 26: //Диазепам (Реланиум), мл
    case 33: //Этамзилат (Дицинон)
    case 35: //Транексамовая кислота
    case 38: //Гидроксиэтилкрахмал
      fcalc = rangeFromTo;
      break;
    case 22: //Папаверин, мл
    case 28: //Фуросемид, мл
    case 30: //Амиодарон (Кордарон)
    case 10: //Дексаметазон, мг
    case 31: //Гепарин натрия
    case 32: //Метоклопрамид (Церукал)
    case 34: //Клемастин (Тавегил)
    case 36: //Димеркапрол (Унитиол)
      fcalc = rangeKoeff;
      break;
  }
  if (fcalc) fcalc();
});
/* =========================================
Допамин калькулятор
============================================*/
mpro.onPageInit("calc_dopamin", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  //Для Детей
  var resChild = page.container.querySelector('[data-block="result-child"]');
  var selChildSpeed = page.container.querySelector('[data-select="child-speed"]');
  var selChildMass = page.container.querySelector('[data-select="child-mass"]');
  selChildMass.onchange = selChildSpeed.onchange = childReCalc;
  var childCapMass = [
    [2, 5, 7, 10],
    [5, 10, 15, 20],
    [10, 20, 30, 40],
    [15, 30, 45, 60],
    [4, 8, 12, 16],
    [5, 10, 15, 20],
    [6, 12, 18, 24],
    [7, 14, 21, 28],
    [8, 16, 24, 32],
    [9, 18, 27, 36],
  ];
  var childInfMass = [
    [0.9, 1.9, 2.8, 3.7],
    [1.9, 3.7, 5.6, 7.5],
    [3.7, 7.5, 11.2, 15.0],
    [5.6, 11.2, 16.9, 22.5],
    [7.5, 15.0, 22.5, 30.0],
    [9.4, 18.7, 28.1, 37.5],
    [11.2, 22.5, 33.7, 45.0],
    [13.1, 26.2, 39.4, 52.5],
    [15.0, 30.0, 45.0, 60.0],
    [16.9, 33.7, 50.6, 67.5],
  ];
  var typeChild = "cap"; // cap, inf
  $$(page.container)
    .find('[name="child-radio"]')
    .on("change", function () {
      typeChild = this.value;
      childReCalc();
    });
  function childReCalc() {
    var resInfo = "Скорость введения: " + selChildSpeed.options[selChildSpeed.selectedIndex].innerText + " мкг/кг*мин";
    resInfo += "<br>Масса тела: " + selChildMass.options[selChildMass.selectedIndex].innerText + " кг";
    if (typeChild == "cap") {
      if (selChildMass.selectedIndex < 4) {
        page.container.querySelector('[data-info="child"]').innerHTML = "Допамин (4%-0,5 мл = 20 мг) в разведении 250 мл р-ра = 0,08 мг/мл";
      } else {
        page.container.querySelector('[data-info="child"]').innerHTML = "Допамин (4%-2,5 мл = 100 мг) в разведении 250 мл р-ра = 0,4 мг/мл";
      }
      resChild.innerHTML = (childCapMass[selChildMass.selectedIndex][selChildSpeed.selectedIndex] + "").replace(".", ",") + " капель в минуту";
    } else {
      page.container.querySelector('[data-info="child"]').innerHTML = "Допамин (4%-1 мл = 40 мг) в разведении 49 мл NaCl 0,9% = 0,8 мг/мл";
      resChild.innerHTML = (childInfMass[selChildMass.selectedIndex][selChildSpeed.selectedIndex] + "").replace(".", ",") + " мл/час";
    }
    resChild.innerHTML += '<hr><div style="color:#607D8B;">' + resInfo + "</div>";
  }
  childReCalc();
  //Для взрослых
  //=======================
  var resParent = page.container.querySelector('[data-block="result-parent"]');
  var typeParent = "cap";
  var selParentSpeed = page.container.querySelector('[data-select="parent-speed"]');
  var selParentSpeedCap = page.container.querySelector('[data-select="parent-speed-cap"]');

  var selParentMass = page.container.querySelector('[data-select="parent-mass"]');
  selParentMass.onchange = selParentSpeed.onchange = selParentSpeedCap.onchange = parentReCalc;
  var parCapMass = [
    [5, 10, 15, 20, 25],
    [6, 12, 18, 24, 30],
    [7, 14, 21, 28, 35],
    [8, 16, 24, 32, 40],
    [9, 18, 27, 36, 45],
    [10, 20, 30, 40, 50],
    [11, 22, 33, 44, 55],
  ];
  var parInfMass = [
    [1.5, 3.7, 7.5, 11.2, 15.0, 18.7],
    [1.8, 4.5, 9.0, 13.5, 18.0, 22.5],
    [2.1, 5.2, 10.5, 15.7, 21.0, 26.2],
    [2.4, 6.0, 12.0, 18.0, 24.0, 30.0],
    [2.7, 6.7, 13.5, 20.2, 27.0, 33.7],
    [3.0, 7.5, 15.0, 22.5, 30.0, 37.5],
    [3.3, 8.2, 16.5, 24.7, 33.0, 41.2],
  ];
  $$(page.container)
    .find('[name="parent-radio"]')
    .on("change", function () {
      typeParent = this.value;
      if (typeParent == "cap") {
        selParentSpeedCap.classList.remove("hidden");
        selParentSpeed.classList.add("hidden");
      } else {
        selParentSpeedCap.classList.add("hidden");
        selParentSpeed.classList.remove("hidden");
      }
      parentReCalc();
    });

  function parentReCalc() {
    var resInfo = "";
    if (typeParent == "cap") {
      resInfo = "Скорость введения: " + selParentSpeedCap.options[selParentSpeedCap.selectedIndex].innerText + " мкг/кг*мин";
      resInfo += "<br>Масса тела: " + selParentMass.options[selParentMass.selectedIndex].innerText + " кг";
      page.container.querySelector('[data-info="parent"]').innerHTML = "Допамин (4%-5 мл = 200 мг) в разведении 250 мл р-ра = 0,8 мг/мл";
      resParent.innerHTML = (parCapMass[selParentMass.selectedIndex][selParentSpeedCap.selectedIndex] + "").replace(".", ",") + " капель в минуту";
    } else {
      resInfo = "Скорость введения: " + selParentSpeed.options[selParentSpeed.selectedIndex].innerText + " мкг/кг*мин";
      resInfo += "<br>Масса тела: " + selParentMass.options[selParentMass.selectedIndex].innerText + " кг";
      page.container.querySelector('[data-info="parent"]').innerHTML = "Допамин (4%-5 мл = 200 мг) в разведении 45 мл NaCl 0,9% = 4 мг/мл";
      resParent.innerHTML = (parInfMass[selParentMass.selectedIndex][selParentSpeed.selectedIndex] + "").replace(".", ",") + " мл/час";
    }
    resParent.innerHTML += '<hr><div style="color:#607D8B;">' + resInfo + "</div>";
    //		resParent.innerHTML = selParentSpeed.selectedIndex;
  }
  parentReCalc();
});
/* =========================================
Справочник анализов
============================================*/
mpro.onPageInit("aig", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var url_page = "PrilAG_" + page.query.id + ".html";
  $$.get("data/aig/" + url_page, function (data) {
    page.container.querySelector(".page-content").innerHTML = data;
    var c = page.container.querySelector('[data-caption="true"]');
    if (c) page.container.querySelector("[data-navcap]").innerText = c.innerText;
  });
});
/* =========================================
Расчет мг
============================================*/
mpro.onPageInit("calc_amp", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var inp_per = page.container.querySelector("#inp_percent");
  var inp_amp = page.container.querySelector("#inp_amp");
  var btnClear = page.container.querySelector("#btnClear");
  var btnCacl = page.container.querySelector("#btnCacl");
  var errBlock = page.container.querySelector("#errorDiv");
  var r = page.container.querySelector("#block-result");
  btnClear.onclick = function () {
    inp_per.value = "";
    inp_amp.value = "";
    errBlock.style.display = "none";
    r.innerHTML = "-";
  };
  btnCacl.onclick = recalc;
  //inp_per.onchange = recalc;
  //inp_amp.onchange = recalc;
  function recalc() {
    if (inp_per.value > 100 || inp_per.value < 0) {
      showError("Концентрация раствора в ампуле: 0-100 ");
      return;
    }
    if (inp_per.value.trim() == "") {
      showError("Заполните поле: Концентрация раствора");
      return;
    }
    if (inp_amp.value.trim() == "") {
      showError("Заполните поле: Объем ампулы");
      return;
    }
    if (inp_amp.value <= 0) {
      showError("Объем ампулы должен быть больше 0 ");
      return;
    }
    errBlock.style.display = "none";
    var numRes = inp_per.value * inp_amp.value * 10;
    r.innerHTML = numRes.toFixed(0) + " мг" + "</br>(" + inp_per.value + " %, " + inp_amp.value + " мл)";
  }
  function showError(txt) {
    r.innerHTML = "-";
    errBlock.style.display = "block";
    errBlock.innerHTML = txt;
  }
});
/* =========================================
О;оги у детей
============================================*/
mpro.onPageInit("calc_burn_baby", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var applyTouch = true;
  var o = page.container.querySelector("#baby-front");
  var resBack = page.container.querySelector("#resBack");
  var mBack = page.container.querySelector("#man-back");
  function touchEl() {
    if (!applyTouch) return;
    if (this.getAttribute("isactive") == "false") {
      this.style.fill = "#ff5555";
      this.setAttribute("isactive", "true");
    } else {
      this.style.fill = "#41b5e1";
      this.setAttribute("isactive", "false");
    }
    calc();
  }
  function tMove() {
    applyTouch = false;
  }
  function tStart() {
    applyTouch = true;
  }

  var r = page.container.querySelector("#resSVG");

  var allBack = mBack.querySelectorAll('[isinter="true"]');
  $$(mBack).touchmove(tMove);
  for (var i = 0; i < allBack.length; i++) {
    $$(allBack[i]).touchend(touchEl);
    $$(allBack[i]).touchstart(tStart);
  }
  var all = o.querySelectorAll('[isinter="true"]');
  $$(o).touchmove(tMove);
  for (var i = 0; i < all.length; i++) {
    $$(all[i]).touchstart(tStart);
    $$(all[i]).touchend(touchEl);
  }

  function calc() {
    var active = o.querySelectorAll('[isactive="true"]');
    var result = 0;
    var rFront = 0;
    for (var i = 0; i < active.length; i++) {
      var p = active[i].getAttribute("percent");
      p = +p;
      rFront += p;
      result += p;
    }
    $$("#resFront").html(rFront + " %");
    var rBack = 0;
    var allBackActive = mBack.querySelectorAll('[isactive="true"]');
    for (var i = 0; i < allBackActive.length; i++) {
      var per = allBackActive[i].getAttribute("percent");
      per = +per;
      rBack += per;
      result += per;
    }
    resBack.innerHTML = rBack + " %";
    r.innerHTML = result + " %";
  }

  var mySwiper = mpro.swiper(".swiper-container", {
    // pagination: '.swiper-pagination',
    // paginationHide: true,
    paginationClickable: true,
    nextButton: ".swiper-button-next",
    prevButton: ".swiper-button-prev",
  });
});
/* =========================================
Ожоги у взрослых
============================================*/
mpro.onPageInit("calc_burn", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var applyTouch = true;
  var o = page.container.querySelector("#man-front");
  var resBack = page.container.querySelector("#resBack");
  var mBack = page.container.querySelector("#man-back");
  function touchEl() {
    if (!applyTouch) return;
    if (this.getAttribute("isactive") == "false") {
      this.style.fill = "#ff5555";
      this.setAttribute("isactive", "true");
    } else {
      this.style.fill = "#41b5e1";
      this.setAttribute("isactive", "false");
    }
    calc();
  }
  function tMove() {
    applyTouch = false;
  }
  function tStart() {
    applyTouch = true;
  }

  var allBack = mBack.querySelectorAll('[isinter="true"]');
  $$(mBack).touchmove(tMove);
  for (var i = 0; i < allBack.length; i++) {
    $$(allBack[i]).touchend(touchEl);
    $$(allBack[i]).touchstart(tStart);
  }
  var all = o.querySelectorAll('[isinter="true"]');
  $$(o).touchmove(tMove);
  for (var i = 0; i < all.length; i++) {
    $$(all[i]).touchstart(tStart);
    $$(all[i]).touchend(touchEl);
  }
  var r = page.container.querySelector("#resSVG");

  function calc() {
    var active = o.querySelectorAll('[isactive="true"]');
    var result = 0;
    var rFront = 0;
    for (var i = 0; i < active.length; i++) {
      var p = active[i].getAttribute("percent");
      p = +p;
      rFront += p;
      result += p;
    }
    $$("#resFront").html(rFront + " %");
    var rBack = 0;
    var allBackActive = mBack.querySelectorAll('[isactive="true"]');
    for (var i = 0; i < allBackActive.length; i++) {
      var per = allBackActive[i].getAttribute("percent");
      per = +per;
      rBack += per;
      result += per;
    }
    resBack.innerHTML = rBack + " %";
    r.innerHTML = result + " %";
  }

  var mySwiper = mpro.swiper(".swiper-container", {
    // pagination: '.swiper-pagination',
    // paginationHide: true,
    paginationClickable: true,
    nextButton: ".swiper-button-next",
    prevButton: ".swiper-button-prev",
  });
});
/* =========================================
Шкала Гласго
============================================*/
mpro.onPageInit("calc_glasgo", function (page) {
  //   if (FSIZE) page.container.classList.add(FSIZE);
  var sEye = page.container.querySelector("#sel_eye"),
    sSp = page.container.querySelector("#sel_speech"),
    sM = page.container.querySelector("#sel_move");
  sEye.onchange = calc;
  sSp.onchange = calc;
  sM.onchange = calc;
  var r = page.container.querySelector("#block-result");
  function calc() {
    if (sEye.selectedIndex == 0 || sSp.selectedIndex == 0 || sM.selectedIndex == 0) {
      r.innerHTML = "Не все параметры вабраны";
      return;
    }
    var intRes = parseInt(sEye.options[sEye.selectedIndex].value) + parseInt(sSp.options[sSp.selectedIndex].value) + parseInt(sM.options[sM.selectedIndex].value);
    r.innerHTML = intRes + " балла(ов)";
    if (intRes == 15) {
      r.innerHTML += "</br>Ясное сознание";
    } else if (intRes >= 13 && intRes <= 14) {
      r.innerHTML += "</br>Умеренное оглушение";
    } else if (intRes >= 11 && intRes <= 12) {
      r.innerHTML += "</br>Глубокое оглушение";
    } else if (intRes >= 8 && intRes <= 10) {
      r.innerHTML += "</br>Сопор";
    } else if (intRes >= 6 && intRes <= 7) {
      r.innerHTML += "</br>Умеренная кома";
    } else if (intRes == 4 || intRes == 5) {
      r.innerHTML += "</br>Глубокая кома";
    } else {
      r.innerHTML += "</br>Запредельная кома";
    }
  }
});
var POPUPISOPEN = {
  MKB: false,
  ZAB: false,
  STD: false,
  POPOVER: false,
  KLIN: false,
  ALG: false,
};
var searchKlinTimeout;
var searchMkbTimeout;
var searchAlgTimeout;
let listKlin = [];
$$.getJSON("data/klin/all_klin.json", function (data) {
  listKlin = data;
});
mpro.searchKlin = function (search) {
  if (search.trim() === "") {
    $$(".popup-klin .search-results").html("");
    return;
  }
  if (searchKlinTimeout) clearTimeout(searchKlinTimeout);
  $$(".popup-klin .preloader").show();
  searchKlinTimeout = setTimeout(function () {
    search = search.split(" ");
    var res = [];
    for (var key in listKlin) {
      var str = listKlin[key];
      var flag = true;
      search.forEach(function (word) {
        if (!~str.search(RegExp(word, "i"))) flag = false;
      });
      if (flag) res.push({ id: key, name: str });
    }
    $$(".popup-klin .preloader").hide();
    if(res.length == 0){
        $$(".popup-klin .search-results").html(`<div class="no-search-result">Ничего не найдено</div>`);
        return;
    }
    $$(".popup-klin .search-results").html(Template7.templates.klinListTemplate(res));
  }, 300);
};
var mySearchKlin = mpro.searchbar(".search-klin", {
  customSearch: true,
  onDisable: function (s) {
    POPUPISOPEN.klin = false;
    $$('.popup-klin input[type="search"]')[0].blur();
    mpro.closeModal(".popup-klin");
  },
  onSearch: function (s, q) {
    mpro.searchKlin(s.query);
  },
  onClear: function (s) {
    $$(".popup-klin .search-results").html("");
  },
});
$$(".popup-klin").on("open", function () {
  POPUPISOPEN.klin = true;
  mySearchKlin.enable();
});
  $$(".popup-klin").on("opened", function () {
    $$('.popup input[type="search"]')[0].focus();
  });
  $$(".popup-klin .search-results").on("click", "li", function () {
    mySearchKlin.disable();
  });
// МКБ-10 ПОИСК
// ===========================================================================
mpro.searchMkb = function (search) {
  var MAXREC = 50;
  if (search.trim() === "") {
    $$(".popup-mkb .search-results").html("");
    return;
  }
  if (searchMkbTimeout) clearTimeout(searchMkbTimeout);
  $$(".popup-mkb .preloader").show();
  searchTimeout = setTimeout(function () {
    var res = [],
      res2 = [],
      res3 = [],
      res4 = [];
    var testCount = 0;
    var isL3 = false;
    var rcode = 4;
    search = search.split(" ");
    for (key in mkbLEVEL4) sArr(res, mkbLEVEL4[key]);

    if (res.length == 0) {
      testCount++;
      rcode = 3;
      for (var key in mkbLEVEL3) sArr(res, mkbLEVEL3[key]);
    } else {
      for (var key in mkbLEVEL3) sArrL3(res3, mkbLEVEL3[key]);
      if (res3.length) isL3 = true;
    }
    if (res.length == 0) {
      testCount++;
      rcode = 2;
      for (var key in mkbLEVEL2) sArr(res, mkbLEVEL2[key]);
    }
    if (res.length == 0) {
      testCount++;
      rcode = 1;
      for (var key in mkbLEVEL1) sArr(res, mkbLEVEL1[key]);
    }
    var html = "";
    if (rcode == 1) html = Template7.templates.mkb101Tmpl(res);
    if (rcode == 2) html = Template7.templates.mkb102Tmpl(res);
    if (rcode == 3) html = Template7.templates.mkb103Tmpl(res);
    if (rcode == 4) html = Template7.templates.mkb104Tmpl(res);
    if (rcode != 3 && isL3) html += Template7.templates.mkb103Tmpl(res3);

    $$(".popup-mkb .search-results").html(html);
    $$(".popup-mkb .preloader").hide();
  }, 300);
  function sArrL3(targetArr, searchArr) {
    for (var i = 0; i < searchArr.length && targetArr.length < MAXREC; i++) {
      if (searchArr[i].ch) continue;
      var flag = true;
      for (var s = 0; s < search.length; s++) {
        if (searchArr[i].n.search(RegExp(search[s], "i")) === -1) flag = false;
      }
      if (flag) targetArr.push(searchArr[i]);
    }
  }
  function sArr(targetArr, searchArr) {
    for (var i = 0; i < searchArr.length && targetArr.length < MAXREC; i++) {
      var flag = true;
      for (var s = 0; s < search.length; s++) {
        if (searchArr[i].n.search(RegExp(search[s], "i")) === -1) flag = false;
      }
      if (flag) targetArr.push(searchArr[i]);
      //if(searchArr[i].n.search(RegExp(search,"i"))!=-1) targetArr.push(searchArr[i]);
    }
  }
};
var mkbSearchBarMKB = mpro.searchbar(".search-mkb", {
  customSearch: true,
  onDisable: function () {
    $$('.popup-mkb input[type="search"]')[0].blur();
    $$(".popup-mkb .search-results").html("");
    mpro.closeModal(".popup-mkb");
    POPUPISOPEN.MKB = false;
  },
  onSearch: function (s) {
    mpro.searchMkb(s.query);
  },
  onClear: function () {
    $$(".popup-mkb .search-results").html("");
  },
});
$$(".popup-mkb").on("open", function () {
  POPUPISOPEN.MKB = true;
  mkbSearchBarMKB.enable();
});
$$(".popup-mkb").on("opened", function () {
  $$('.popup-mkb input[type="search"]')[0].focus();
  $$('.popup-mkb input[type="search"]')[0].focus();
});
$$(".popup-mkb .search-results").on("click", "li", function () {
  if (!this.querySelector("a")) return;
  mkbSearchBarMKB.disable();
});
// -------------------------МКБ-10 ПОИСК--------------------------------------
const PP_SELECTOR_ALG = `.popup-alg`;
mpro.searchAlg = function (search) {
  if (search.trim() === "") {
    $$(`${PP_SELECTOR_ALG} .search-results`).html("");
    return;
  }
  if (searchAlgTimeout) clearTimeout(searchAlgTimeout);
  $$(`${PP_SELECTOR_ALG} .preloader`).show();
  searchAlgTimeout = setTimeout(function () {
    search = search.split(" ");
    var res = [];
    for(let i=0;i<ALG_MENU.length;i++){
      const main = ALG_MENU[i];
      for(let j=0;j<main.items.length;j++){
        const str = main.items[j].label;
        let flag = true;
        search.forEach(function (word) {
          if (!~str.search(RegExp(word, "i"))) flag = false;
        });
        if (flag) res.push(main.items[j]);
      }
    }
    $$(`${PP_SELECTOR_ALG} .preloader`).hide();
    if(res.length == 0){
        $$(`${PP_SELECTOR_ALG} .search-results`).html(`<div class="no-search-result">Ничего не найдено</div>`);
        return;
    }
    $$(`${PP_SELECTOR_ALG} .search-results`).html(Template7.templates.searchAlgTemplate(res));
  }, 300);
};
var searchAlg = mpro.searchbar(`${PP_SELECTOR_ALG}`, {
  customSearch: true,
  onDisable: function (s) {
    POPUPISOPEN.ALG = false;
    $$(`${PP_SELECTOR_ALG} input[type="search"]`)[0].blur();
    mpro.closeModal(`${PP_SELECTOR_ALG}`);
  },
  onSearch: function (s, q) {
    mpro.searchAlg(s.query);
  },
  onClear: function (s) {
    $$(`${PP_SELECTOR_ALG} .search-results`).html("");
  },
});
$$(`${PP_SELECTOR_ALG}`).on("open", function () {
  POPUPISOPEN.ALG = true;
  searchAlg.enable();
});
  $$(`${PP_SELECTOR_ALG}`).on("opened", function () {
    $$('.popup input[type="search"]')[0].focus();
  });
  $$(`${PP_SELECTOR_ALG} .search-results`).on("click", "li", function () {
    searchAlg.disable();
  });

var app = {
  initialize: function () {
    document.addEventListener("deviceready", this.onDeviceReady.bind(this), false);
  },
  onDeviceReady: function () {},
};

app.initialize();
console.log(KLIN_REC);